## Section 1: thiwanka_offsite_test

### importing pandas

In [3]:
import pandas as pd

### Loading CSV Files

In [7]:
df_product = pd.read_csv("input_files/product_info.csv")
df_sales = pd.read_csv("input_files/retail_sales.csv")
df_store_details = pd.read_csv("input_files/store_details.csv")

In [11]:
df_sales.head()

   Transaction_ID Transaction_Date  Product_ID  Store_ID  Quantity  Unit_Price
0               1       2023-11-24        1006         9         1       26.86
1               2       2023-02-27        1003         1        15       17.48
2               3       2023-01-13        1007         1         8       87.47
3               4       2023-05-21        1004         4        11       96.51
4               5       2023-05-06        1006         9        12        7.97

## Summary Statistics of Numerical Columns

### Sales - Summary Statistics

In [12]:
df_sales[["Quantity", "Unit_Price"]].describe()

         Quantity  Unit_Price
count  500.000000  500.000000
mean    10.064000   52.479500
std      5.520585   26.176497
min      1.000000    5.030000
25%      5.000000   29.372500
50%     10.000000   54.230000
75%     15.000000   73.822500
max     19.000000   99.570000

## Merging Datasets

In [16]:
df_merged1 = df_sales.merge(df_product, left_on='Product_ID', right_on='Product_ID')

In [18]:
df_merged = df_merged1.merge(df_store_details, left_on='Store_ID', right_on='Store_ID')

In [19]:
df_merged.head()

,Transaction_ID,Transaction_Date,Product_ID,Store_ID,Quantity,Unit_Price,Product_Name,Category,Store_Name,Country
0,1,2023-11-24,1006,9,1,26.86,Product_1006,Electronics,Store_9,UK
1,2,2023-02-27,1003,1,15,17.48,Product_1003,Groceries,Store_1,Canada
2,3,2023-01-13,1007,1,8,87.47,Product_1007,Electronics,Store_1,Canada
3,4,2023-05-21,1004,4,11,96.51,Product_1004,Electronics,Store_4,Canada
4,5,2023-05-06,1006,9,12,7.97,Product_1006,Electronics,Store_9,UK

### Creating New Column "Total Sales"

In [20]:
df_merged['Total Sales'] = df_merged['Quantity'] * df_merged['Unit_Price']

In [21]:
df_merged.head()

,Transaction_ID,Transaction_Date,Product_ID,Store_ID,Quantity,Unit_Price,Product_Name,Category,Store_Name,Country,Total Sales
0,1,2023-11-24,1006,9,1,26.86,Product_1006,Electronics,Store_9,UK,26.86
1,2,2023-02-27,1003,1,15,17.48,Product_1003,Groceries,Store_1,Canada,262.20
2,3,2023-01-13,1007,1,8,87.47,Product_1007,Electronics,Store_1,Canada,699.76
3,4,2023-05-21,1004,4,11,96.51,Product_1004,Electronics,Store_4,Canada,1061.61
4,5,2023-05-06,1006,9,12,7.97,Product_1006,Electronics,Store_9,UK,95.64

In [24]:
df_merged.dtypes

Transaction_ID        int64
Transaction_Date     object
Product_ID            int64
Store_ID              int64
Quantity              int64
Unit_Price          float64
Product_Name         object
Category             object
Store_Name           object
Country              object
Total Sales         float64
dtype: object

### Grouping Data by Country

#### Total Sales by Country

In [ ]:
df_merged[["Country", "Total Sales"]].groupby("Country").sum()

         Total Sales
Country
Canada     130084.58
UK          20647.56
USA        113593.88

#### Average Order Values by Contry (Assumed Order Value as Order Quantity)

In [28]:
df_merged[["Country", "Quantity"]].groupby("Country").mean()

          Quantity
Country
Canada   10.161017
UK        9.595745
USA      10.059908

#### Total Transactions by Country

In [29]:
df_merged.groupby("Country")["Country"].count()

Country
Canada    236
UK         47
USA       217
Name: Country, dtype: int64

### Exporting Dataframe into a CSV File

In [33]:
df_merged.to_csv('final_sales_data.csv', index=False)

### Function that returns top 5 selling products

In [51]:
def top_selling_products_by_conutries():
    return df_merged[["Country", "Product_Name"]].groupby(["Country", "Product_Name"]).max(5)

In [58]:
top_products = top_selling_products_by_conutries()
top_products

Empty DataFrame
Columns: []
Index: [(Canada, Product_1000), (Canada, Product_1001), (Canada, Product_1002), (Canada, Product_1003), (Canada, Product_1004), (Canada, Product_1005), (Canada, Product_1006), (Canada, Product_1007), (Canada, Product_1008), (Canada, Product_1009), (UK, Product_1000), (UK, Product_1001), (UK, Product_1002), (UK, Product_1003), (UK, Product_1004), (UK, Product_1005), (UK, Product_1006), (UK, Product_1007), (UK, Product_1008), (UK, Product_1009), (USA, Product_1000), (USA, Product_1001), (USA, Product_1002), (USA, Product_1003), (USA, Product_1004), (USA, Product_1005), (USA, Product_1006), (USA, Product_1007), (USA, Product_1008), (USA, Product_1009)]

In [59]:
df_merged['Transaction_Date'].to_csv('date.csv', index=False)